{
    "positive": [
        "They were professional and respectful throughout the process, explaining everything clearly.",
        "I appreciated their prompt response and how they handled the situation calmly.",
        "The officers showed empathy and understanding, which made a difficult experience easier to bear.",
        "They ensured my rights were respected and treated me fairly during the entire process.",
        "Despite the circumstances, they maintained a level of professionalism and courtesy.",
        "I felt intimidated and nervous at first, but they were surprisingly patient and reassuring.",
        "Their thoroughness in the investigation gave me confidence in their commitment to justice.",
        "I was pleasantly surprised by their transparency and willingness to answer my questions.",
        "Their presence made me feel safer, even though I was being detained.",
        "I was impressed by their attention to detail and commitment to resolving the situation.",
        "Their communication was clear and concise, which helped alleviate some of my anxiety.",
        "Despite the tension of the situation, they remained calm and composed.",
        "I appreciated that they treated me with dignity and respect throughout the process.",
        "Their professionalism helped me trust that the outcome would be fair and just.",
        "Their thorough investigation ensured that all aspects of the situation were properly addressed.",
        "I felt supported and advocated for during the entire process.",
        "Their demeanor helped de-escalate the situation and prevent it from escalating further.",
        "They showed genuine concern for my well-being and safety.",
        "Their patience and willingness to listen made me feel like my voice mattered.",
        "I was grateful for their assistance and guidance throughout the process.",
        "Their professionalism and attention to detail gave me confidence in their ability to handle the situation.",
        "They handled the situation with sensitivity and respect for my privacy.",
        "Their actions were firm but fair, and they ensured that I understood the reasons behind their decisions.",
        "Despite the circumstances, they treated me with dignity and respect.",
        "Their professionalism helped me feel reassured during a stressful experience.",
        "Their efforts to keep me informed and involved in the process were greatly appreciated.",
        "Their commitment to following proper procedures helped me trust in the fairness of the outcome.",
        "I felt like they genuinely cared about my well-being and safety.",
        "Their willingness to listen to my perspective helped resolve the situation more amicably.",
        "Despite the seriousness of the situation, they remained approachable and understanding."
    ],
    "negative": [
        "They were rude and disrespectful, making the situation more stressful than it needed to be.",
        "Their response was slow and inadequate, leaving me feeling vulnerable and unsafe.",
        "The officers showed no empathy or understanding, treating me like a criminal from the start.",
        "They violated my rights and treated me unfairly throughout the entire process.",
        "Their demeanor was aggressive and confrontational, escalating the situation unnecessarily.",
        "I felt harassed and intimidated by their behavior, which only added to my distress.",
        "Their investigation was sloppy and incomplete, leaving important details overlooked.",
        "They were evasive and uncooperative, refusing to provide me with any information.",
        "Their presence made me feel more threatened and anxious, rather than protected.",
        "I was appalled by their lack of professionalism and disregard for proper procedure.",
        "Their communication was vague and confusing, leaving me in the dark about what was happening.",
        "They were chaotic and disorganized, unable to handle the situation effectively.",
        "I felt degraded and humiliated by their treatment, as if I had no rights at all.",
        "Their conduct was unbecoming of law enforcement officers, undermining trust in the system.",
        "Their investigation was biased and one-sided, ignoring crucial evidence and testimonies.",
        "I felt abandoned and alone throughout the process, with no support or guidance.",
        "Their aggression only served to escalate the situation further, putting everyone at risk.",
        "They showed no concern for my well-being or safety, only focused on asserting their authority.",
        "Their dismissive attitude made me feel like my voice didn't matter at all.",
        "I received no help or assistance from them, despite being in a vulnerable position.",
        "Their incompetence was glaringly obvious, making me question their ability to handle any situation.",
        "They showed no respect for my privacy or dignity, treating me like a criminal.",
        "Their actions were arbitrary and unjust, leaving me feeling powerless and disillusioned.",
        "I felt degraded and dehumanized by their treatment, as if I were less than human.",
        "Their lack of professionalism only added to the chaos of the situation, making matters worse.",
        "Their indifference to my plight was disheartening, leaving me feeling abandoned and alone.",
        "Their disregard for proper procedure and protocol eroded any trust I had in them.",
        "I felt like just another number to them, rather than a human being in need of help.",
        "Their refusal to listen to my side of the story only served to perpetuate injustice.",
        "Despite my attempts to cooperate, they treated me with suspicion and hostility."
    ]
}